
using UnityEngine;
using System;
using System.IO;
public class MathsTool{

	/// <summary>
	/// 只需要提供0-90度的值，其他都可以算出来
	/// </summary>
	public static double[] CosValue = {
		1,0.9998477,0.9993908,0.9986295,0.9975641,0.9961947,0.9945219,
		0.9925461,0.9902681,0.9876884,0.9848077,0.9816272,0.9781476,
		0.9743701,0.9702957,0.9659258,0.9612617,0.9563048,0.9510565,
		0.9455186,0.9396926,0.9335804,0.9271839,0.9205049,0.9135454,
		0.9063078,0.8987941,0.8910065,0.8829476,0.8746197,0.8660254,
		0.8571673,0.8480481,0.8386706,0.8290376,0.8191521,0.809017,
		0.7986355,0.7880108,0.7771459,0.7660444,0.7547096,0.7431448,
		0.7313537,0.7193398,0.7071068,0.6946584,0.6819984,0.6691306,
		0.656059,0.6427876,0.6293204,0.6156615,0.601815,0.5877853,
		0.5735765,0.5591929,0.5446391,0.5299193,0.5150381,0.5,0.4848096,
		0.4694716,0.4539905,0.4383712,0.4226182,0.4067366,0.3907312,
		0.3746066,0.358368,0.3420202,0.3255681,0.309017,0.2923718,
		0.2756374,0.2588191,0.2419219,0.224951,0.2079117,0.1908091,
		0.1736482,0.1564345,0.1391731,0.1218693,0.1045284,0.0871558,
		0.06975651,0.05233597,0.0348995,0.01745238,-4.371139E-08,
	};
		
	/// <summary>
	/// 暂时度数固定写几个，以后可以根据需要把0-180之间的所有cos值提供出来
	/// </summary>
	/// <param name="angle">Angle.</param>
	public static float Cos(int angle){
		float flag = 1;//正负号
		float value = 0;//最终值
		int tempAngel = angle;//转换到0-180度的angle
		if(tempAngel<0)tempAngel=-tempAngel;//把角度限制到正360
		if (tempAngel >= 360)tempAngel %= 360;
		if (tempAngel > 90 && tempAngel < 270)flag = -1;
		else flag = 1;
		tempAngel %= 90;//限制到90度内
		value = (float)(CosValue [tempAngel] * flag);
		return value;
	}

    /// <summary>
    /// 角度限制在360内
    /// </summary>
    /// <param name="degree"></param>
    /// <returns></returns>
    public static float Limit2_360Degree(float degree)
    {
        float _result = degree;
        if (degree < 0)
        {
            _result += 360;
        }
        else if (degree > 360)
        {
            _result -= 360;
            _result = Limit2_360Degree(_result);//这个递归有点危险啊
        }
        return _result;

    }
}
